app/views/cameras/update_cam_info.html.erb

                      <!--finf by id-->
                      <% db_model_fw_cam = Camera.find(db_camera_name_obj_array[index]) %>
---
SELECT  "cameras".* FROM "cameras" WHERE "cameras"."id" = ? LIMIT 1  [["id", 2639]]